//-------------------------------主页信息加载脚本---------------------------------------






/*
*公告显示,轮播图数据
*
*
*/
var a = [
    {
        "title" : "标题1",
        "info" : "添加信息内容（不超过200字）",
        "style" : "slide"
    },
    {
        "title" : "标题2",
        "info" : "添加信息内容（不超过200字）",
        "style" : "slide2"
    },
    {
        "title" : "标题3",
        "info" : "添加信息内容（不超过200字）",
        "style" : "slide3"
    }
]
   
new Vue({
    el: '#app1',
    data: {
        webNotice : a
    }
})

/*
*
*信息模块
*
*
*/
new Vue({
    el: '#app2',
    data: {
        "title" : "添加小标题",
        "paragraph1" : "添加段落内容（不超过80个字）",
        "paragraph2" : "添加段落内容（不超过80个字）"
    }
})


/*
*
*平台数据
*
*/
new Vue({
    el: '#app3',
    data: {
       "browse" : 1225,
       "user" : 774,
       "praise" : 588,
       "title" :"标题信息",
       "info": "添加信息"
    }
})

/*
*
*功能特色信息
*
*
*/
var b = [
    {
        "title" : "标题1",
        "info" : "添加信息内容（不超过80字）"
    },
    {
        "title" : "标题2",
        "info" : "添加信息内容（不超过80字）"
    },
    {
        "title" : "标题3",
        "info" : "添加信息内容（不超过80字）"
    },
    {
        "title" : "标题4",
        "info" : "添加信息内容（不超过80字）"
    },
    {
        "title" : "标题5",
        "info" : "添加信息内容（不超过80字）"
    },
    {
        "title" : "标题6",
        "info" : "添加信息内容（不超过80字）"
    }
]
   
new Vue({
    el: '#app4',
    data: {
        functions : b
    }
})