//-------------------------------主页信息加载脚本---------------------------------------






/*
*公告显示,轮播图数据
*
*
*/
var webNotice = [
    {
        "title" : "标题1",
        "info" : "添加信息内容（不超过200字）"
    },
    {
        "title" : "标题2",
        "info" : "添加信息内容（不超过200字）"
    },
    {
        "title" : "标题3",
        "info" : "添加信息内容（不超过200字）"
    }
]
   
new Vue({
    el: '#app1',
    data: {
        webNotice : [
            {
                "title" : "标题1",
                "info" : "添加信息内容（不超过200字）",
                "style" : "slide1"
            },
            {
                "title" : "标题2",
                "info" : "添加信息内容（不超过200字）",
                "style" : "slide2"
            },
            {
                "title" : "标题3",
                "info" : "添加信息内容（不超过200字）",
                "style" : "slide3"
            }
        ]
    }
})

//
